{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 25, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["input_1", 0, 0, {}], ["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims", "op": "ExpandDims", "input": ["conv2d_1/Relu", "ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3}}, "name": "tf_op_layer_ExpandDims", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_1", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_1", "op": "ExpandDims", "input": ["conv2d_2/Relu", "ExpandDims_1/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, "constants": {"1": 3}}, "name": "tf_op_layer_ExpandDims_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d", "trainable": true, "batch_input_shape": [null, null, null, 25, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 25, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d", "inbound_nodes": [[["tf_op_layer_ExpandDims", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_1", "trainable": true, "batch_input_shape": [null, null, null, 25, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 25, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_1", "inbound_nodes": [[["tf_op_layer_ExpandDims_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice", "op": "StridedSlice", "input": ["conv_lst_m2d/transpose_1", "strided_slice/begin", "strided_slice/end", "strided_slice/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "23"}, "begin_mask": {"i": "23"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 0, 0, 1, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice", "inbound_nodes": [[["conv_lst_m2d", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_1", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_1", "op": "StridedSlice", "input": ["conv_lst_m2d_1/transpose_1", "strided_slice_1/begin", "strided_slice_1/end", "strided_slice_1/strides"], "attr": {"begin_mask": {"i": "23"}, "shrink_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "23"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 0, 0, 1, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_1", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LeakyRelu", "trainable": true, "dtype": "float32", "node_def": {"name": "LeakyRelu", "op": "LeakyRelu", "input": ["strided_slice"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_LeakyRelu", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LeakyRelu_1", "trainable": true, "dtype": "float32", "node_def": {"name": "LeakyRelu_1", "op": "LeakyRelu", "input": ["strided_slice_1"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_LeakyRelu_1", "inbound_nodes": [[["tf_op_layer_strided_slice_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2", "op": "AddV2", "input": ["LeakyRelu", "AddV2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0], [0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 0.0, 0.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0]]}}, "name": "tf_op_layer_AddV2", "inbound_nodes": [[["tf_op_layer_LeakyRelu", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["LeakyRelu_1", "AddV2_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0]]}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["tf_op_layer_LeakyRelu_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax", "op": "Softmax", "input": ["AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax", "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax_1", "op": "Softmax", "input": ["AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax_1", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6V0Y6L2ZpbmFs\nIHRoZXNpcy9iYWNrLXVwIGNvZGUvZml4ZWQgbGVuZ3RoIGF0dGVudGlvbi9maXhlZCBsZW5ndGgg\nYXR0ZW50aW9uL3NnY25fbHN0bS5wedoIPGxhbWJkYT4mAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["tf_op_layer_Softmax", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6V0Y6L2ZpbmFs\nIHRoZXNpcy9iYWNrLXVwIGNvZGUvZml4ZWQgbGVuZ3RoIGF0dGVudGlvbi9maXhlZCBsZW5ndGgg\nYXR0ZW50aW9uL3NnY25fbHN0bS5wedoIPGxhbWJkYT4vAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["tf_op_layer_Softmax_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["lambda", 0, 0, {}], ["lambda_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [15, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [20, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_2", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_2", "op": "ExpandDims", "input": ["conv2d_7/Relu", "ExpandDims_2/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, "constants": {"1": 3}}, "name": "tf_op_layer_ExpandDims_2", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims_3", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims_3", "op": "ExpandDims", "input": ["conv2d_8/Relu", "ExpandDims_3/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": 3}}, "name": "tf_op_layer_ExpandDims_3", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_2", "trainable": true, "batch_input_shape": [null, null, null, 25, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 25, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_2", "inbound_nodes": [[["tf_op_layer_ExpandDims_2", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_3", "trainable": true, "batch_input_shape": [null, null, null, 25, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 25, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_3", "inbound_nodes": [[["tf_op_layer_ExpandDims_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_2", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_2", "op": "StridedSlice", "input": ["conv_lst_m2d_2/transpose_1", "strided_slice_2/begin", "strided_slice_2/end", "strided_slice_2/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "23"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "23"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "8"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 0, 0, 1, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_2", "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_3", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_3", "op": "StridedSlice", "input": ["conv_lst_m2d_3/transpose_1", "strided_slice_3/begin", "strided_slice_3/end", "strided_slice_3/strides"], "attr": {"T": {"type": "DT_FLOAT"}, "end_mask": {"i": "23"}, "begin_mask": {"i": "23"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 0, 0, 0, 0], "2": [0, 0, 0, 1, 0], "3": [1, 1, 1, 1, 1]}}, "name": "tf_op_layer_strided_slice_3", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LeakyRelu_2", "trainable": true, "dtype": "float32", "node_def": {"name": "LeakyRelu_2", "op": "LeakyRelu", "input": ["strided_slice_2"], "attr": {"alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_LeakyRelu_2", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "LeakyRelu_3", "trainable": true, "dtype": "float32", "node_def": {"name": "LeakyRelu_3", "op": "LeakyRelu", "input": ["strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, "constants": {}}, "name": "tf_op_layer_LeakyRelu_3", "inbound_nodes": [[["tf_op_layer_strided_slice_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_2", "op": "AddV2", "input": ["LeakyRelu_2", "AddV2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0], [0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 0.0, 0.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0]]}}, "name": "tf_op_layer_AddV2_2", "inbound_nodes": [[["tf_op_layer_LeakyRelu_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_3", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_3", "op": "AddV2", "input": ["LeakyRelu_3", "AddV2_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 